<template>
    <div>
      在很多单位的局域网中，会有服务器提供给用户使用。但由于局域网中一般很少架设DNS服务器，访问这些服务器时，要输入难记的IP地址。这对不少人来说相当麻烦。现在可以分别给这些服务器取个容易记住的名字，然后在Hosts中建立IP映射，这样以后访问的时候，只要输入这个服务器的名字就行了。
      现在有很多网站不经过用户同意就将各种各样的插件安装到你的计算机中，其中有些说不定就是木马或病毒。对于这些网站我们可以利用Hosts把该网站的域名映射到错误的IP或本地计算机的IP，这样就不用访问了。我们约定127.0.0.1为本地计算机的IP地址, 0.0.0.0是错误的IP地址。这样，计算机解析域名 A和 B时，就解析到本机IP或错误的IP，达到了屏蔽网站A 和B的目的。
    </div>
</template>

<script>
    export default{
        data(){
            return{
            }
        },
        components:{
        }
    }
</script>
<style scoped>
  body{
    background-color:#ff0000;
  }
</style>
